### Terraform CI Summary

**Format & Style:** ✅ `success`  
**Initialization:** ✅ `success`  
**Validation:** ✅ `success`  
**Plan:** ✅ `success`  

<details>
<summary>Show Terraform Plan</summary>

```
[0m[1mmodule.kube-hetzner.hcloud_ssh_key.k3s[0]: Refreshing state... [id=101165330][0m
[0m[1mmodule.kube-hetzner.random_password.k3s_token: Refreshing state... [id=none][0m
[0m[1mmodule.kube-hetzner.random_password.rancher_bootstrap[0]: Refreshing state... [id=none][0m
[0m[1mmodule.kube-hetzner.hcloud_load_balancer.control_plane[0]: Refreshing state... [id=4308708][0m
[0m[1mmodule.kube-hetzner.data.hcloud_ssh_keys.keys_by_selector[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.hcloud_placement_group.agent[0]: Refreshing state... [id=1126590][0m
[0m[1mmodule.kube-hetzner.hcloud_network.k3s[0]: Refreshing state... [id=11372486][0m
[0m[1mmodule.kube-hetzner.hcloud_firewall.k3s: Refreshing state... [id=2381780][0m
[0m[1mmodule.kube-hetzner.hcloud_placement_group.control_plane[0]: Refreshing state... [id=1126591][0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.kured[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.kured[0]: Read complete after 0s [id=203405526][0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_ccm[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Read complete after 1s[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_csi[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.hcloud_ssh_keys.keys_by_selector[0]: Read complete after 1s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Read complete after 0s[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_ccm[0]: Read complete after 0s [id=229419124][0m
[0m[1mmodule.kube-hetzner.local_file.kustomization_backup[0]: Refreshing state... [id=ef162be06bb944e4d85518dc5e66750bbcc0e722][0m
[0m[1mmodule.kube-hetzner.data.hcloud_network.k3s: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.hcloud_load_balancer_service.control_plane[0]: Refreshing state... [id=4308708__6443][0m
[0m[1maws_route53_record.rancher_api_ipv6: Refreshing state... [id=Z00476003F8RX1KPNHHY4_rancher.baphomet.cloud_AAAA][0m
[0m[1maws_route53_record.rancher_ipv4: Refreshing state... [id=Z00476003F8RX1KPNHHY4_rancher.baphomet.cloud_A][0m
[0m[1maws_route53_record.cluster_api_ipv6: Refreshing state... [id=Z00476003F8RX1KPNHHY4_api.baphomet.cloud_AAAA][0m
[0m[1maws_route53_record.cluster_api_ipv4: Refreshing state... [id=Z00476003F8RX1KPNHHY4_api.baphomet.cloud_A][0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_csi[0]: Read complete after 0s [id=237686054][0m
[0m[1mmodule.kube-hetzner.data.hcloud_network.k3s: Read complete after 1s [name=kube-baphomet][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[0]: Refreshing state... [id=11372486-10.0.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[1]: Refreshing state... [id=11372486-10.1.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[0]: Refreshing state... [id=11372486-10.255.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[2]: Refreshing state... [id=11372486-10.253.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[1]: Refreshing state... [id=11372486-10.254.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[2]: Refreshing state... [id=11372486-10.2.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_load_balancer_network.control_plane[0]: Refreshing state... [id=4308708-11372486][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].random_string.identity_file: Refreshing state... [id=jcmqn8grt1jxb0tpndjs][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].random_string.identity_file: Refreshing state... [id=zu8hh4kl22jpsbjx5jox][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].random_string.identity_file: Refreshing state... [id=n49zk1tvnkgv9uoknwpf][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].random_string.server: Refreshing state... [id=qpd][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].random_string.server: Refreshing state... [id=sqi][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].random_string.server: Refreshing state... [id=mei][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].data.cloudinit_config.config: Read complete after 0s [id=1355841410][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].data.cloudinit_config.config: Read complete after 0s [id=3968017059][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].data.cloudinit_config.config: Read complete after 0s [id=2558689923][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_server.server: Refreshing state... [id=107330533][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_server.server: Refreshing state... [id=107330534][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_server.server: Refreshing state... [id=107330532][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].random_string.identity_file: Refreshing state... [id=fkba7dtes2s3bxtu6buq][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].random_string.identity_file: Refreshing state... [id=p1xmkq6uhb72k1xv9l6a][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].random_string.identity_file: Refreshing state... [id=696zfdx0w72bsmoo9mg9][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].random_string.server: Refreshing state... [id=irb][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].random_string.server: Refreshing state... [id=vnl][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].random_string.server: Refreshing state... [id=dpu][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].data.cloudinit_config.config: Read complete after 0s [id=4075448402][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].data.cloudinit_config.config: Read complete after 0s [id=2640231118][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].data.cloudinit_config.config: Read complete after 0s [id=1145046264][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].hcloud_server.server: Refreshing state... [id=107330530][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].hcloud_server.server: Refreshing state... [id=107330529][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].hcloud_server.server: Refreshing state... [id=107330531][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.zram: Refreshing state... [id=8032846648933223505][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.registries: Refreshing state... [id=4428706636174830696][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.zram: Refreshing state... [id=1850208348142212128][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.registries: Refreshing state... [id=6364501856186144396][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.zram: Refreshing state... [id=5318858245110814887][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.registries: Refreshing state... [id=7559133708980465610][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_rdns.server[0]: Refreshing state... [id=s-107330532-91.98.29.19][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_rdns.server[0]: Refreshing state... [id=s-107330533-5.75.224.184][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_rdns.server_ipv6[0]: Refreshing state... [id=s-107330533-2a01:4f8:c012:c0f1::1][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_rdns.server_ipv6[0]: Refreshing state... [id=s-107330534-2a01:4f9:c012:f19::1][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_rdns.server_ipv6[0]: Refreshing state... [id=s-107330532-2a01:4f8:c0c:7460::1][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_rdns.server[0]: Refreshing state... [id=s-107330534-95.216.160.119][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.os_upgrade_toggle: Refreshing state... [id=8793421754933899087][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.os_upgrade_toggle: Refreshing state... [id=8507479273153800968][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.os_upgrade_toggle: Refreshing state... [id=7089566442417855125][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].null_resource.zram: Refreshing state... [id=7075836802159378013][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].null_resource.zram: Refreshing state... [id=3240937513969605084][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].null_resource.zram: Refreshing state... [id=1999536762171839731][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].null_resource.registries: Refreshing state... [id=1913344249933560420][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].null_resource.registries: Refreshing state... [id=3735853140282932567][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].null_resource.registries: Refreshing state... [id=43691772946096257][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].hcloud_rdns.server[0]: Refreshing state... [id=s-107330530-195.201.238.37][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].hcloud_rdns.server[0]: Refreshing state... [id=s-107330529-65.108.83.235][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].hcloud_rdns.server[0]: Refreshing state... [id=s-107330531-188.245.148.8][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].hcloud_rdns.server_ipv6[0]: Refreshing state... [id=s-107330531-2a01:4f8:c2c:5aff::1][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].hcloud_rdns.server_ipv6[0]: Refreshing state... [id=s-107330530-2a01:4f8:c012:32a0::1][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].hcloud_rdns.server_ipv6[0]: Refreshing state... [id=s-107330529-2a01:4f9:c013:b38e::1][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].null_resource.os_upgrade_toggle: Refreshing state... [id=1507829844564382426][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].null_resource.os_upgrade_toggle: Refreshing state... [id=6331459539207924706][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].null_resource.os_upgrade_toggle: Refreshing state... [id=2339170658067940178][0m
[0m[1mmodule.kube-hetzner.hcloud_load_balancer_target.control_plane[0]: Refreshing state... [id=lb-label-selector-tgt-cce5ca51924c8441ae6340603a779f7ffb5294654badc53ee0570f3bb5efc5ae-4308708][0m
[0m[1mmodule.kube-hetzner.null_resource.first_control_plane: Refreshing state... [id=4873441118460822012][0m
[0m[1mmodule.kube-hetzner.null_resource.authentication_config["0-0-control-plane-0"]: Refreshing state... [id=5446154894405617528][0m
[0m[1mmodule.kube-hetzner.null_resource.authentication_config["1-0-control-plane-1"]: Refreshing state... [id=7145659173107205520][0m
[0m[1mmodule.kube-hetzner.null_resource.authentication_config["2-0-control-plane-2"]: Refreshing state... [id=7408444343936015721][0m
[0m[1mmodule.kube-hetzner.null_resource.control_plane_config["0-0-control-plane-0"]: Refreshing state... [id=4416822852798994245][0m
[0m[1mmodule.kube-hetzner.null_resource.control_plane_config["2-0-control-plane-2"]: Refreshing state... [id=131922185047456979][0m
[0m[1mmodule.kube-hetzner.null_resource.control_plane_config["1-0-control-plane-1"]: Refreshing state... [id=7638001485232487321][0m
[0m[1mmodule.kube-hetzner.null_resource.control_planes["1-0-control-plane-1"]: Refreshing state... [id=445998983958695862][0m
[0m[1mmodule.kube-hetzner.null_resource.control_planes["0-0-control-plane-0"]: Refreshing state... [id=7265119658766517182][0m
[0m[1mmodule.kube-hetzner.null_resource.control_planes["2-0-control-plane-2"]: Refreshing state... [id=6963242142726148814][0m
[0m[1mmodule.kube-hetzner.ssh_sensitive_resource.kubeconfig: Refreshing state... [id=9098654560424243049][0m
[0m[1mmodule.kube-hetzner.local_sensitive_file.kubeconfig[0]: Refreshing state... [id=53f10518d43d553dfd89c3e9f34f9fd4dea4aa9d][0m
[0m[1mmodule.kube-hetzner.null_resource.kustomization: Refreshing state... [id=8457834685118153080][0m
[0m[1mmodule.kube-hetzner.null_resource.agent_config["1-0-worker-1"]: Refreshing state... [id=1071596317550481406][0m
[0m[1mmodule.kube-hetzner.null_resource.agent_config["2-0-worker-2"]: Refreshing state... [id=5430432579734666668][0m
[0m[1mmodule.kube-hetzner.null_resource.agent_config["0-0-worker-0"]: Refreshing state... [id=4568283626534076874][0m
[0m[1mmodule.kube-hetzner.null_resource.agents["1-0-worker-1"]: Refreshing state... [id=4038508776287430183][0m
[0m[1mmodule.kube-hetzner.null_resource.agents["0-0-worker-0"]: Refreshing state... [id=5626424062944040014][0m
[0m[1mmodule.kube-hetzner.null_resource.agents["2-0-worker-2"]: Refreshing state... [id=5597082273884444016][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.kube-hetzner.local_file.kustomization_backup[0][0m will be created
[0m  [32m+[0m[0m resource "local_file" "kustomization_backup" {
      [32m+[0m[0m content              = (sensitive value)
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0777"
      [32m+[0m[0m file_permission      = "600"
      [32m+[0m[0m filename             = "kube-baphomet_kustomization_backup.yaml"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.kube-hetzner.local_sensitive_file.kubeconfig[0][0m will be created
[0m  [32m+[0m[0m resource "local_sensitive_file" "kubeconfig" {
      [32m+[0m[0m content              = (sensitive value)
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0700"
      [32m+[0m[0m file_permission      = "600"
      [32m+[0m[0m filename             = "kube-baphomet_kubeconfig.yaml"
      [32m+[0m[0m id                   = (known after apply)
    }

[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

*Pushed by @muchasxmaracas, Action: `pull_request`*